clnt_backup/benchmark/out/keyblock_10000/8K_ECDHE.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.31.36.248 (be patient)


Server Software:        nginx/1.11.1
Server Hostname:        172.31.36.248
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256

Document Path:          /8K.bin
Document Length:        8192 bytes

Concurrency Level:      10
Time taken for tests:   21.440 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      42210000 bytes
HTML transferred:       40960000 bytes
Requests per second:    233.21 [#/sec] (mean)
Time per request:       42.880 [ms] (mean)
Time per request:       4.288 [ms] (mean, across all concurrent requests)
Transfer rate:          1922.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       12   35   0.9     35      46
Processing:     4    8   0.5      7      10
Waiting:        4    8   0.5      7      10
Total:         21   43   0.9     42      51
ERROR: The median and mean for the processing time are more than twice the standard
       deviation apart. These results are NOT reliable.
ERROR: The median and mean for the waiting time are more than twice the standard
       deviation apart. These results are NOT reliable.
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%     42
  66%     43
  75%     44
  80%     44
  90%     44
  95%     44
  98%     44
  99%     44
 100%     51 (longest request)